<template>
  <visitor-dashboard title="О Нас">
    <div style="display: flex; flex-direction: column; align-items: center">
      <base-image src="/images/logo.png" :size="16"></base-image>

      <h1 style="margin-top: 0">Веб-Сайт Библиотека МТЭК</h1>
      <h3 style="margin-top: 0">
        Веб-Сайт разработан Лауренчикасом Марком Павловичем <el-tag style="text-size: 1.5rem">Группы ПО409</el-tag>
      </h3>

      <div style="width: 60%; font-size: 1.125rem; display: flex; flex-direction: column; text-align: justify">
        <p>
          Наша библиотека представляет собой уникальный источник знаний и информации, доступный каждому
          интернет-пользователю. Наш сайт разработан для того, чтобы помочь вам находить и получать доступ к широкому
          ассортименту книг.
        </p>
        <p>
          Главная страница сайта библиотеки предлагает вам простую и удобную навигацию, позволяющую легко найти
          интересующие вас материалы. Вы можете воспользоваться поиском, чтобы быстро найти нужную книгу или автора, или
          воспользоваться разделами и категориями, чтобы исследовать различные тематические области.
        </p>
        <p>
          Мы предлагаем широкий выбор жанров и тематик, чтобы удовлетворить разнообразные интересы наших читателей. На
          данный момент библиотека включает в себя <el-tag type="success">58.000</el-tag> экземпляров. От классической
          литературы до современных бестселлеров, от научно-популярных книг до технической литературы - у нас вы найдете
          все, что нужно для развлечения, саморазвития и образования.
        </p>
      </div>
    </div>
  </visitor-dashboard>
</template>

<script setup lang="ts">
import { VisitorDashboard } from '@/components/pages';
import { BaseImage } from '@/components/tags/base';
import { ElTag } from 'element-plus';
</script>
